Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.3.152/CA90/atdf/PIC32CZ2051CA90100.atdf
        <register name="TSSSL" offset="0x11C8" rw="R" size="4" initval="0x00000000" caption="1588 Timer Sync Strobe Seconds [31:0] Register">
          <bitfield name="VTS" caption="Value of Timer Seconds Register Capture" mask="0xFFFFFFFF"/>
        </register>
        <register name="TSSN" offset="0x11CC" rw="R" size="4" initval="0x00000000" caption="1588 Timer Sync Strobe Nanoseconds Register">
          <bitfield name="VTN" caption="Value Timer Nanoseconds Register Capture" mask="0x3FFFFFFF"/>
        </register>
        <register name="TSL" offset="0x11D0" rw="RW" size="4" initval="0x00000000" caption="1588 Timer Seconds [31:0] Register">
          <bitfield name="TCS" caption="Timer Count in Seconds" mask="0xFFFFFFFF"/>
        </register>
        <register name="TN" offset="0x11D4" rw="RW" size="4" initval="0x00000000" caption="1588 Timer Nanoseconds Register">
          <bitfield name="TNS" caption="Timer Count in Nanoseconds" mask="0x3FFFFFFF"/>
        </register>
        <register name="TA" offset="0x11D8" rw="RW" size="4" initval="0x00000000" caption="1588 Timer Adjust Register">
          <bitfield name="ITDT" caption="Increment/Decrement" mask="0x3FFFFFFF"/>
          <bitfield name="ADJ" caption="Adjust 1588 Timer" mask="0x80000000"/>
        </register>
        <register name="TI" offset="0x11DC" rw="RW" size="4" initval="0x00000000" caption="1588 Timer Increment Register">
          <bitfield name="CNS" caption="Count Nanoseconds" mask="0xFF"/>
          <bitfield name="ACNS" caption="Alternative Count Nanoseconds" mask="0xFF00"/>
          <bitfield name="NIT" caption="Number of Increments" mask="0xFF0000"/>
        </register>
        <register name="EFTSL" offset="0x11E0" rw="R" size="4" initval="0x00000000" caption="PTP Event Frame Transmitted Seconds Low Register">
          <bitfield name="RUD" caption="Register Update" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFTN" offset="0x11E4" rw="R" size="4" initval="0x00000000" caption="PTP Event Frame Transmitted Nanoseconds">
          <bitfield name="RUD" caption="Register Update" mask="0x3FFFFFFF"/>
        </register>
        <register name="EFRSL" offset="0x11E8" rw="R" size="4" initval="0x00000000" caption="PTP Event Frame Received Seconds Low Register">
          <bitfield name="RUD" caption="Register Update" mask="0xFFFFFFFF"/>
        </register>
        <register name="EFRN" offset="0x11EC" rw="R" size="4" initval="0x00000000" caption="PTP Event Frame Received Nanoseconds">
          <bitfield name="RUD" caption="Register Update" mask="0x3FFFFFFF"/>
        </register>
        <register name="PEFTSL" offset="0x11F0" rw="R" size="4" initval="0x00000000" caption="PTP Peer Event Frame Transmitted Seconds Low Register">
          <bitfield name="RUD" caption="Register Update" mask="0xFFFFFFFF"/>
        </register>
        <register name="PEFTN" offset="0x11F4" rw="R" size="4" initval="0x00000000" caption="PTP Peer Event Frame Transmitted Nanoseconds">
          <bitfield name="RUD" caption="Register Update" mask="0x3FFFFFFF"/>
        </register>
        <register name="PEFRSL" offset="0x11F8" rw="R" size="4" initval="0x00000000" caption="PTP Peer Event Frame Received Seconds Low Register">
          <bitfield name="RUD" caption="Register Update" mask="0xFFFFFFFF"/>
        </register>
        <register name="PEFRN" offset="0x11FC" rw="R" size="4" initval="0x00000000" caption="PTP Peer Event Frame Received Nanoseconds">
          <bitfield name="RUD" caption="Register Update" mask="0x3FFFFFFF"/>
        </register>
        <register name="TPQ1" offset="0x1260" rw="RW" size="4" initval="0xFFFFFFFF" caption="Transmit Pause Quantum Register 1">
          <bitfield name="QP2" caption="Transmit pause quantum priority 2" mask="0xFFFF"/>
          <bitfield name="QP3" caption="Transmit pause quantum priority 3" mask="0xFFFF0000"/>
        </register>
        <register name="TPQ2" offset="0x1264" rw="RW" size="4" initval="0xFFFFFFFF" caption="Transmit Pause Quantum Register 2">
          <bitfield name="QP4" caption="Transmit pause quantum priority 4" mask="0xFFFF"/>
          <bitfield name="QP5" caption="Transmit pause quantum priority 5" mask="0xFFFF0000"/>
        </register>
        <register name="TPQ3" offset="0x1268" rw="RW" size="4" initval="0xFFFFFFFF" caption="Transmit Pause Quantum Register 3">
          <bitfield name="QP6" caption="Transmit pause quantum priority 6" mask="0xFFFF"/>
          <bitfield name="QP7" caption="Transmit pause quantum priority 7" mask="0xFFFF0000"/>
        </register>
        <register name="RLPITR" offset="0x1270" rw="R" size="4" initval="0x00000000" caption="Receive LPI transition Register">
          <bitfield name="RLPITR" caption="Count number of times transition from rx normal idle to low power idle" mask="0xFFFF"/>
        </register>
        <register name="RLPITI" offset="0x1274" rw="R" size="4" initval="0x00000000" caption="Receive LPI Time Register">
          <bitfield name="RLPITI" caption="Increment once over 16 ahb clock when LPI indication bit 20 is set in rx mode" mask="0xFFFFFF"/>
        </register>
        <register name="TLPITR" offset="0x1278" rw="R" size="4" initval="0x00000000" caption="Receive LPI transition Register">
          <bitfield name="TLPITR" caption="Count number of times enable LPI tx bit 20 goes from low to high" mask="0xFFFF"/>
        </register>
        <register name="TLPITI" offset="0x127C" rw="R" size="4" initval="0x00000000" caption="Receive LPI Time Register">
          <bitfield name="TLPITI" caption="Increment once over 16 ahb clock when LPI indication bit 20 is set in tx mode" mask="0xFFFFFF"/>
        </register>
        <register name="DSNCFGDBG" offset="0x1280" rw="R" size="4" count="10" initval="0x00000000" caption="Design Configuration Debug">
          <bitfield name="DSNCFGDBG" caption="Design Configuration Debug" mask="0xFFFFFFFF"/>
        </register>
        <register-group name="SAU" name-in-module="SA" offset="0x1300" size="0x8" count="32"/>
        <register name="ISRQ" offset="0x1400" rw="RW" size="4" count="15" initval="0x00000000" caption="Interrupt Status Register Queues">
          <bitfield name="RCOMP" caption="Receive Complete" mask="0x2"/>
          <bitfield name="RXUBR" caption="RX Used Bit Read" mask="0x4"/>
          <bitfield name="TXUBR" caption="TX Used Bit Read" mask="0x8"/>
          <bitfield name="TUR" caption="Transmit Underrun" mask="0x10"/>
          <bitfield name="RLEX" caption="Retry Limit Exceeded" mask="0x20"/>
          <bitfield name="TFC" caption="Transmit Frame Corruption Due to AHB Error" mask="0x40"/>
          <bitfield name="TCOMP" caption="Transmit Complete" mask="0x80"/>
          <bitfield name="ROVR" caption="Receive Overrun" mask="0x400"/>
          <bitfield name="HRESP" caption="HRESP Not OK" mask="0x800"/>
        </register>
        <register name="TBPQB" offset="0x1440" rw="RW" size="4" count="15" initval="0x00000000" caption="Transmit Priority Queue Buffer Base Address">
        </register>
        <register name="RBPQB" offset="0x1480" rw="RW" size="4" count="7" initval="0x00000000" caption="Receive Priority Queue Buffer Base Address">
        </register>
        <register name="RBQSZ" offset="0x14A0" rw="RW" size="4" count="7" initval="0x00000002" caption="Receive Priority Queue Buffer Size">
          <bitfield name="RXBUFSZ" caption="DMA Receive Buffer Size" mask="0xFF"/>
        </register>
