Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.3.152/CA90/atdf/PIC32CZ2051CA90100.atdf
        <register name="FRAME" offset="0x100C" rw="R" size="2" initval="0x0000" caption="Holds The Last Received Frame Number">
          <bitfield name="FRMNUM" caption="Frame Number" mask="0x7FF"/>
        </register>
        <register name="INDEX" offset="0x100E" rw="RW" size="1" initval="0x00" caption="Index Is A 4-Bit Register That Determines Which Endpoint Control/Status Registers Are Accessed">
          <bitfield name="SELEP" caption="The Selected Endpoint" mask="0xF" values="INDEX__SELEP"/>
        </register>
        <register name="TESTMODE" offset="0x100F" rw="RW" size="1" initval="0x00" caption="Not Used In Normal Operation. Configuration To Put the USBCORE Into One Of The Four Test Modes For HighSpeed Operation">
          <bitfield name="TESTSE0NAK" caption="Set To Enter The Test_SE0_NAK mode" mask="0x1"/>
          <bitfield name="TESTJ" caption="Set To Enter The Test_J mode" mask="0x2"/>
          <bitfield name="TESTK" caption="Set To Enter The Test_K mode" mask="0x4"/>
          <bitfield name="TESTPACKET" caption="Set To Enter The Test_Packet mode" mask="0x8"/>
          <bitfield name="FORCEHS" caption="Depending On Bit 7 Force Controller Into High Speed Mode" mask="0x10"/>
          <bitfield name="FORCEFS" caption="Depending On Bit 7 Force Controller Into FS Speed Mode" mask="0x20"/>
          <bitfield name="FIFOACCESS" caption="The CPU Sets This Bit To Transfer The Packet In The Endpoint 0 TX FIFO To The Endpoint 0 Rx FIFO. It Is Cleared Automatically." mask="0x40"/>
          <bitfield name="FORCEHOST" caption="The CPU Sets This Bit To Instruct The Core To Enter Host Mode When The Session Bit Is Set" mask="0x80"/>
        </register>
        <register modes="ENDPOINTX" name="TXMAXP" offset="0x1010" rw="RW" size="2" initval="0x0000" caption="ENDPOINTX Maximum Amount Of Data That Can Be Transferred Through The Selected TX Endpoint In A Single Operation">
          <bitfield name="MAXPAYLOAD" caption="Maximum Payload/Transactions" mask="0x7FF"/>
          <bitfield name="MULTIPLIER" caption="Multiplier Value (m-1)" mask="0xF800"/>
        </register>
        <register modes="ENDPOINTX" name="TXCSRL" offset="0x1012" rw="RW" size="1" initval="0x00" caption="ENDPOINTX Control And Status Bits for TX Endpoints 1-15">
          <mode name="HOST_EPX" qualifier="USBHS.DEVCTL.HOSTMODE" value="1" caption="Selected EP1-15 in Host Mode"/>
          <mode name="PERIPHERAL_EPX" qualifier="USBHS.DEVCTL.HOSTMODE" value="0" caption="Selected EP1-15 in Peripheral Mode"/>
          <bitfield name="TXPKTRDY" caption="The CPU Sets This Bit After Loading A Data Packet Into The FIFO." mask="0x1"/>
          <bitfield name="FIFONOTEMPTY" caption="The USB Sets This Bit When There Is At Least 1 Packet In The TX FIFO." mask="0x2"/>
          <bitfield modes="HOST_EPX" name="ERROR" caption="This Bit Will Be Set When Three Attempts Have Been Made To Perform A Transaction With No Response From The Peripheral" mask="0x4"/>
          <bitfield modes="PERIPHERAL_EPX" name="UNDERRUN" caption="The USB Sets This Bit If An In Token Is Received When TxPktRdy Is Not Set." mask="0x4"/>
          <bitfield name="FLUSHFIFO" caption="The CPU Writes A 1 To This Bit To Flush The Latest Packet From The Endpoint TX FIFO" mask="0x8"/>
          <bitfield modes="PERIPHERAL_EPX" name="SENDSTALL" caption="The CPU Writes A 1 To This Bit To Issue A Stall Handshake To An In Token" mask="0x10"/>
          <bitfield modes="HOST_EPX" name="SETUPPKT" caption="The CPU Sets This Bit, At The Same Time As The TxPktRdy Bit Is Set, To Send A SETUP Token Instead Of An OUT Token For The Transaction" mask="0x10"/>
          <bitfield modes="HOST_EPX" name="RXSTALL" caption="This Bit Is Set When A Stall Handshake Is Received." mask="0x20"/>
          <bitfield modes="PERIPHERAL_EPX" name="SENTSTALL" caption="This Bit Is Set When A Stall Handshake Is Transmitted." mask="0x20"/>
          <bitfield name="CLRDATATOG" caption="The CPU Writes A 1 To This Bit To Reset The Endpoint Data Toggle To 0." mask="0x40"/>
          <bitfield modes="PERIPHERAL_EPX" name="INCOMPTX" caption="When The Endpoint Is Being Used For High-Bandwidth Isochronous, This Bit Is Set To Indicate Where A Large Packet Has Been Split Into 2 Or 3 Packets For Transmission But Insufficient IN Tokens Have Been Received To Send All The Parts." mask="0x80"/>
          <bitfield modes="HOST_EPX" name="NAKTIMEOUT" caption="This Bit Will Be Set When Endpoint 0 Is Halted Following The Receipt Of NAK Responses For Longer Than The Time Set By The NAKLimit0 register." mask="0x80"/>
        </register>
        <register modes="ENDPOINT0" name="CSR0L" offset="0x1012" rw="RW" size="1" initval="0x00" caption="ENDPOINT0 Control And Status Bits for TX Endpoint 0">
          <mode name="HOST_EP0" qualifier="USBHS.DEVCTL.HOSTMODE" value="1" caption="Selected EP0 In Host Mode"/>
          <mode name="PERIPHERAL_EP0" qualifier="USBHS.DEVCTL.HOSTMODE" value="0" caption="Selected EP0 In Peripheral Mode"/>
          <bitfield name="RXPKTRDY" caption="This Bit Is Set When A Data Packet Has Been Received" mask="0x1"/>
          <bitfield name="TXPKTRDY" caption="The CPU Sets This Bit After Loading A Data Packet Into The FIFO." mask="0x2"/>
          <bitfield modes="HOST_EP0" name="RXSTALL" caption="This Bit Is Set When A Stall Handshake Is Received." mask="0x4"/>
          <bitfield modes="PERIPHERAL_EP0" name="SENTSTALL" caption="This Bit Is Set When A Stall Handshake Is Transmitted." mask="0x4"/>
          <bitfield modes="PERIPHERAL_EP0" name="DATAEND" caption="The CPU Sets This Bit 1. When Setting TxPktRdy For The Last Data Packet 2. When Clearing RxPktRdy After Unloading The Last Data Packet.3. When Setting TxPktRdy For A Zero Length Data Packet." mask="0x8"/>
          <bitfield modes="HOST_EP0" name="SETUPPKT" caption="The CPU Sets This Bit, At The Same Time As The TxPktRdy Bit Is Set, To Send A SETUP Token Instead Of An OUT Token For The Transaction" mask="0x8"/>
          <bitfield modes="HOST_EP0" name="ERROR" caption="This Bit Will Be Set When Three Attempts Have Been Made To Perform A Transaction With No Response From The Peripheral" mask="0x10"/>
          <bitfield modes="PERIPHERAL_EP0" name="SETUPEND" caption="This Bit Will Be Set When A Control Transaction Ends Before The DataEnd Bit Has Been Set" mask="0x10"/>
          <bitfield modes="HOST_EP0" name="REQPKT" caption="The CPU Sets This Bit To Request An IN Transaction" mask="0x20"/>
          <bitfield modes="PERIPHERAL_EP0" name="SENDSTALL" caption="The CPU Writes A 1 To This Bit To Terminate The Current Transaction" mask="0x20"/>
          <bitfield modes="PERIPHERAL_EP0" name="SERVICEDRXPKTRDY" caption="The CPU Writes A 1 To This Bit To Clear The RxPktRdy Bit. It Is Cleared Automatically" mask="0x40"/>
          <bitfield modes="HOST_EP0" name="STATUSPKT" caption="The CPU Sets This Bit At The Same Time As The TxPktRdy Or ReqPkt Bit Is Set, To Perform A Status Stage Transaction" mask="0x40"/>
          <bitfield modes="HOST_EP0" name="NAKTIMEOUT" caption="This Bit Will Be Set When Endpoint 0 Is Halted Following The Receipt Of NAK Responses For Longer Than The Time Set By The NAKLimit0 register." mask="0x80"/>
          <bitfield modes="PERIPHERAL_EP0" name="SERVICEDSETUPEND" caption="The CPU Writes A 1 To This Bit To Clear The SetupEnd Bit. It Is Cleared Automatically." mask="0x80"/>
        </register>
